#include "push.h"	// добавление элемента в  стэк
#include "size.h"	// выводит размер стека и сам стек
#include "last.h"	// узнаем последний элемент стэка
#include "pop.h"		// извлечение элемента из стэка
#include "clear.h"	// очистка стэка

void Stack()
{
	int choose, x = 0, i, val = 0;
	bool k = 0;
	STACK stack;
	stack.count = 0;
	for (i = 0; i < 255; i++) stack.elem[i] = 0;
	cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
	while(k == 0)
	{
		cout << "¬ыберите, что необходимо сделать со стеком: \n";
		cout << "1: ƒобавить новый элемент(ы) \n";
		cout << "2: ”знать значение последнего элемента \n";
		cout << "3: ¬ывести стек \n";
		cout << "4: ќчистить стэк \n";
		cout << "5: »звлечь последний элемент \n";
		cout << "\n0: ¬ыход\n";
		cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
		cin >> choose;
		cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
		switch (choose)
		{
			case (1): 
			{
				x = 0;
				cout << "—колько элементов вы хотите ввести сразу?";
				cin >> x;
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				cout << "¬ведите элемент(ы):\n";
				for(i = 0; i < x; i++) 
				{
					cin >> val;
					push(&stack, val);
				}
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				break;
			};
			case (2):
			{
				val = LastElement(&stack);
				cout << "ѕоследний элемент имеет значение:";
				cout << val << endl;
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				break;
			};
			case (3): 
			{
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				size(&stack);
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				break;
			};
			case (4):
			{
				clear(&stack);
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				break;
			};
			case (5):
			{
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				val = pop(&stack);
				cout << "»звлеченный элемент имеет значение:";
				cout << val << endl;
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				break;
			};
			case (0):
			{
				k = true;
				cout << "¬ыполн€етс€ выход\n";
				cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
				break;
			}
			default:
			{
				cout << "¬ы ввели неверное значение! ѕовторите ввод:\n";
				break;
			}
		}
	}
}