using namespace std;
#include "sortgen.h"
#include "sortshow.h"
#include "everysort.h"

void Sort()
{
	int n,
		choose1 = -1,		// выбор сортировки
		choose2 = 2;		// выбор ввода
	int *array;

	while (choose1 != 0)
	{
		while (choose1 > 4 || choose1 < 0)
		{
			cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
			cout << "¬ыберите алгоритм сортировки: \n";
			cout << "1: —ортировка \"пузырьком\". \n";
			cout << "2: —ортировка Ўелла. \n";
			cout << "3: ѕирамидальна€ сортировка. \n";
			cout << "4: \"Ѕыстра€\" сортировка. \n";
			cout << "\n0: ¬ыход \n";
			cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
			cin >> choose1;
			cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
		}
		if (choose1 != 0)
		{
			cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
			cout << "∆елаете ввести массив вручную или сгенерировать случайным образом?\n";
			cout << "1: –учной ввод массива.\n";
			cout << "2: √енераци€ массива.\n";
			cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
			cin >> choose2;
			cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
			cout << "¬ведите размер массива.\n";
			cin >> n; // получаем размер динамического массива
			array = new int[n]; // выдел€ем пам€ть под динамический массив
			if (choose2 == 1)
			{
				cout << "¬ведите значени€ элементов массива. \n";
				for (int i = 0; i < n; i++)
				{
					cin >> array[i];
				}
			}
			else
			{
				int min = 0, max = 100; // вводим переменные дл€ ограничени€ значений эл-в
				cout << "¬ведите нижнюю и верхнюю границы генерации элементов.\n";
				cin >> min >> max; // получаем минимальное и максимальное значени€ элементов
				sortGen(array, n, min, max); // генерируем массив
			}
			cout << "Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч-Ч\n";
			cout << "ћассив до сортировки:\n";
			sortShowHor(array, n);
			switch (choose1)
			{
				case 1:
				{
					bubble(array, n);
					break;
				}
				case 2:
				{
					shell(array, n);
					break;
				}
				case 3:
				{
					heapSort(array, n);
					break;
				}
				case 4:
				{
					qs(array, 0, n-1);
					break;
				}
				default:
				{
					cout << "¬ы ввели неверное значение! ѕовторите ввод:\n";
					break;
				}
			}
			choose1 = -1;
			cout << "ћассив после сортировки:\n";
			sortShowHor(array, n);
	
			delete[] array; // освобождаем место, выделенное под массив
		}
	}
}